Revit 2027 API
TableCellStyleOverrideOptions Properties
The TableCellStyleOverrideOptions type exposes the following members.
Properties
Name | Description
BackgroundColor |  Indicates if the background color characteristic is overridden.
Bold |  Indicates if the bold characteristic is overridden.
BorderBottomLineStyle |  Indicates if the border bottom line style characteristic is overridden.
BorderLeftLineStyle |  Indicates if the border left line style characteristic is overridden.
BorderLineStyle |  Indicates if the border line style characteristic is overridden.
BorderRightLineStyle |  Indicates if the border right line style characteristic is overridden.
BorderTopLineStyle |  Indicates if the border top line style characteristic is overridden.
Font |  Indicates if the font name characteristic is overridden.
FontColor |  Indicates if the font color characteristic is overridden.
FontSize |  Indicates if the font size characteristic is overridden.
HorizontalAlignment |  Indicates if the horizontal alignment characteristic is overridden.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Italics |  Indicates if the italics characteristic is overridden.
TextOrientation |  Indicates if the text orientation characteristic is overridden.
Underline |  Indicates if the underline characteristic is overridden.
VerticalAlignment |  Indicates if the vertical alignment characteristic is overridden.
Top
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace